БухЭксп/Catalogs/CW_Грузоперевозки.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_Грузоперевозки</Name>
			<Comment>Грузоперевозки</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyOfItems</HierarchyType>
			<BasedOn>
				<xr:Item>Catalog.CW_Заявки</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДатаСделкиФ</Name>
					<Comment>Дата сделки (фактическая)</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Клиент</Name>
					<Comment>Клиент</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>Комментарий</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МенеджерПродаж</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОперативныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Груз</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Маршрут</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_МаршрутыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипПеревозки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипыПеревозок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Типоразмер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ТипоразмерыКонтейнеров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CW_Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказ</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заказы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СодержитДинамическиеПараметры</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Архив</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Незаполнена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Заявки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтслеживаемоеОборудование</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_ОтслеживаемоеОборудование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПривязкиОборудования</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтключитьСлежение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КомментарийБюджета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Перекодирована</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Коносамент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Коносаменты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПараметрыГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Параметр</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Примечание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1000</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеПлан</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеФакт</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ХранилищеДанных</Name>
							<Type>
								<v8:Type>v8:ValueStorage</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КонтрагентыПоБюджету</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:TypeSet>cfg:DefinedType.CW_Контрагенты</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ГруппыПараметровГрузоперевозки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Идентификатор</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВедущего</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторыВедомых</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Раскрывать</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторГруппы</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ИдентификаторВладельца</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Порядок</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/InformationRegisters/CW_ХарактеристикиГрузоперевозок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>CW_ХарактеристикиГрузоперевозок</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.CW_ПараметрыГрузоперевозок</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеПлан</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЗначениеФакт</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ХранилищеДанных</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИдентификаторВладельца</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Порядок</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Грузоперевозка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CW_Грузоперевозки</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.CW_ПараметрыГрузоперевозок</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/Enums/CW_РеквизитыКоносамента.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_РеквизитыКоносамента</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Букинг</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесБрутто</Name>
					<Comment>Брутто вес груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесНетто</Name>
					<Comment>Нетто вес груза</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесТары</Name>
					<Comment>Вес тары в килограммах</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВидКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ГармонизированныйКод</Name>
					<Comment>Код груза в соответствии с классификацией ВТО</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДатаПогрузкиНаСудно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоговорСКлиентом</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Доставка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Извещать</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассОпасности</Name>
					<Comment>Классификация опасного груза IMO CLASS/UN NO</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоУпаковок</Name>
					<Comment>Количество упаковок в грузовой единице</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Линия</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НомерКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Объем</Name>
					<Comment>Объем груза в м3</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОписаниеГруза</Name>
					<Comment>Описание груза </Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Организация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправитель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пломба</Name>
					<Comment>Номер пломбы грузовой единицы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Получатель</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПортПерегрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рейс</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Судно</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалВыгрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалОтправки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТерминалПерегрузки</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ТипКоносамента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Упаковка</Name>
					<Comment>Наименование упаковки груза в грузовой единице </Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Catalogs/CW_Грузоперевозки/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	
	ЗаполнитьПредопределенныеПараметры = Истина;
	ВводНаОснованииЗаявки = Ложь;           
	
	Если ДанныеЗаполнения = Неопределено Тогда
		
		ДанныеЗаполнения = Новый Структура;
	
		ТипП = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойТипГрузоперевозки");
		Если ТипП <> Неопределено Тогда
			
			// проверяем, что основной тип перевозки доступен пользователю
			ГруппаПользователя = CW_ПраваДоступа_ПИ.ГруппаПользователя(CW_Настройки.Пользователь());
			Если ГруппаПользователя.ОграничениеПоТипамГрузоперевозок Тогда
				МассивДоступныхТипов = Новый Массив;
				Для каждого Стр Из ГруппаПользователя.ДоступныеТипыГрузоперевозок Цикл
					МассивДоступныхТипов.Добавить(Стр.ТипГрузоперевозки);
				КонецЦикла; 
				
				Если МассивДоступныхТипов.Найти(ТипП) = Неопределено Тогда
					ТипП = Справочники.CW_ТипыПеревозок.ПустаяСсылка();
				КонецЕсли;
			КонецЕсли;
			
			ДанныеЗаполнения.Вставить("ТипПеревозки",ТипП);
		КонецЕсли; 	
		
		Если Не ДанныеЗаполнения.Свойство("МенеджерПродаж") Тогда
			ОсновнойМенеджерПродаж = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойМенеджерПродаж");
			Если ОсновнойМенеджерПродаж <> Неопределено Тогда
				ДанныеЗаполнения.Вставить("МенеджерПродаж",ОсновнойМенеджерПродаж);
			КонецЕсли;   
		КонецЕсли;
		
		Если Не ДанныеЗаполнения.Свойство("ОперативныйМенеджер") Тогда
			ОсновнойОперативныйМенеджер = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойОперативныйМенеджер");
			Если ОсновнойОперативныйМенеджер <> Неопределено Тогда
				ДанныеЗаполнения.Вставить("ОперативныйМенеджер",ОсновнойОперативныйМенеджер);
			КонецЕсли;
		КонецЕсли;
	
	ИначеЕсли ТипЗнч(ДанныеЗаполнения)=Тип("Структура") Тогда 
		
		Если ДанныеЗаполнения.Свойство("Коносамент") Тогда  
			ЗаполнитьПоКоносаменту(ДанныеЗаполнения);
		Иначе
			Если ДанныеЗаполнения.Свойство("Заявка") Тогда
				Заявка = ДанныеЗаполнения.Заявка;
				ВводНаОснованииЗаявки = ЗначениеЗаполнено(Заявка);
			КонецЕсли; 
			
			ЗаполненоПоЗаказу = Ложь;
			
			// сразу заполним реквизиты шапки по Заказу
			Если ДанныеЗаполнения.Свойство("Заказ") Тогда
				Если ЗначениеЗаполнено(ДанныеЗаполнения.Заказ) Тогда
					// если какие-либо реквизиты будут ещё и в в структуре ДанныеЗаполнения, то они отработают позже, т.е. будут иметь приоритет
					ЗаполнитьЗначенияСвойств(ЭтотОбъект, ДанныеЗаполнения.Заказ, , "Код,Наименование,Комментарий,Ссылка,ВерсияДанных,Родитель,Владелец");
					Заказ = ДанныеЗаполнения.Заказ;
					ЗаполненоПоЗаказу = истина; // по заявке AFR-250172
				КонецЕсли;
			КонецЕсли;
			
			Если ДанныеЗаполнения.Свойство("ТипПеревозки") Тогда
				ТипПеревозки = ДанныеЗаполнения.ТипПеревозки;    
			КонецЕсли;
			
			// заполняем предопределенные
			Если ДанныеЗаполнения.Свойство("ЗаполнитьПараметры") Тогда 
				
				Если ДанныеЗаполнения.ЗаполнитьПараметры Тогда
					ЗаполнитьПредопределенныеПараметры();
					ЗаполнитьПредопределенныеПараметры = Ложь;
					
					Если ЗначениеЗаполнено(ТипПеревозки) Тогда
						_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(ЭтотОбъект, ТипПеревозки, "ДляГрузоперевозки");
						
						// переносим иерархию
						// копируем группы из типа 
						ГруппыПараметровГрузоперевозки.Загрузить(ТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить());
						
						// переносим параметры из типа
						Для каждого СтрПараметр Из ТипПеревозки.ПараметрыГрузоперевозки Цикл
							Отбор = Новый Структура("Параметр", СтрПараметр.Параметр);
							СтрокаПараметра = _сф.к_НайтиСтроку(ПараметрыГрузоперевозки, Отбор);
							Если (СтрокаПараметра = Неопределено) Тогда
								// добавляем
								Нстр = ПараметрыГрузоперевозки.Добавить();
								Нстр.Параметр = СтрПараметр.Параметр;
							КонецЕсли; 
						КонецЦикла; 
						
					КонецЕсли;
					
				КонецЕсли;
				
			КонецЕсли;  
			
		КонецЕсли;
	
	ИначеЕсли (ТипЗнч(ДанныеЗаполнения) = Тип("СправочникСсылка.CW_Заявки")) Тогда 
		
		ВводНаОснованииЗаявки = Истина;
		Заявка = ДанныеЗаполнения;  
		
	КонецЕсли;  
	
	Если ВводНаОснованииЗаявки Тогда
		
		Для каждого СтрокаПараметраЗаявки Из Заявка.ПараметрыЗаявки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ЭтотОбъект,СтрокаПараметраЗаявки.Параметр);
			Если (СтрокаПараметра <> Неопределено) Тогда
				
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда
					СтрокаПараметра.Значение = СтрокаПараметраЗаявки.Значение;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеПлан) Тогда
					СтрокаПараметра.ЗначениеПлан = СтрокаПараметраЗаявки.ЗначениеПлан;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт) Тогда
					СтрокаПараметра.ЗначениеФакт = СтрокаПараметраЗаявки.ЗначениеФакт;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.Примечание) Тогда
					СтрокаПараметра.Примечание = СтрокаПараметраЗаявки.Примечание;
				КонецЕсли;
				
			КонецЕсли; 
			
		КонецЦикла;
		
	КонецЕсли;
	
	Если ВводНаОснованииЗаявки и Не ЗаполненоПоЗаказу Тогда
		
		ДатаСделкиФ 	= ТекущаяДата();
		Клиент 			= Заявка.Контрагент;
		Груз 			= Заявка.Груз;
		Маршрут 		= Заявка.Маршрут;
		МенеджерПродаж 	= Заявка.МенеджерПродаж;
		Типоразмер 		= Заявка.Типоразмер;
		
		Если не ЗначениеЗаполнено(ТипПеревозки) Тогда
			ТипПеревозки 	= Заявка.ТипПеревозки;
		КонецЕсли;

		Если ЗаполнитьПредопределенныеПараметры Тогда
			ЗаполнитьПредопределенныеПараметры();
		КонецЕсли;
		
		// заполняем параметры типа перевозки
		Если ЗначениеЗаполнено(ТипПеревозки) Тогда
			ГруппыПараметровГрузоперевозки.Загрузить(ТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить());
			ПараметрыГрузоперевозки.Загрузить(ТипПеревозки.ПараметрыГрузоперевозки.Выгрузить());
		КонецЕсли;
		
		// переносим параметры, которые соответствуют заявке
		Для каждого СтрокаПараметраЗаявки Из Заявка.ПараметрыЗаявки Цикл
			
			СтрокаПараметра = CW_Мониторинг.СтрокаПараметра(ЭтотОбъект,СтрокаПараметраЗаявки.Параметр);
			Если СтрокаПараметра <> Неопределено Тогда
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда
					СтрокаПараметра.Значение = СтрокаПараметраЗаявки.Значение;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеПлан) Тогда
					СтрокаПараметра.ЗначениеПлан = СтрокаПараметраЗаявки.ЗначениеПлан;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.ЗначениеФакт) Тогда
					СтрокаПараметра.ЗначениеФакт = СтрокаПараметраЗаявки.ЗначениеФакт;
				КонецЕсли;
				Если НЕ ЗначениеЗаполнено(СтрокаПараметра.Примечание) Тогда
					СтрокаПараметра.Примечание = СтрокаПараметраЗаявки.Примечание;
				КонецЕсли;
			КонецЕсли; 
			
		КонецЦикла; 
		
		Если ЗначениеЗаполнено(ТипПеревозки) Тогда
			_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(ЭтотОбъект, ТипПеревозки, "ДляГрузоперевозки");
		КонецЕсли;
		
		// установим свойство, чтоб при записи перенести бюджет
		_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ПеренестиБюджетИзЗаявки",Истина);
		
	КонецЕсли; 
	
	
КонецПроцедуры

Процедура ЗаполнитьПоКоносаменту(ДанныеЗаполнения)
	
	Коносамент = ДанныеЗаполнения.Коносамент;    
	
	Заявка = Коносамент.Заявка;
	ТипПеревозки = Коносамент.ТипПеревозки;   
	Клиент	= Коносамент.Контрагент;
	МенеджерПродаж = Коносамент.Заявка.МенеджерПродаж;
	
	Если Не ЗначениеЗаполнено(МенеджерПродаж) Тогда
		МенеджерПродаж = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойМенеджерПродаж");
	КонецЕсли;
	
	ОперативныйМенеджер = CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОсновнойОперативныйМенеджер");
	
	Маршрут = Коносамент.Заявка.Маршрут;

	Груз = Коносамент.Заявка.Груз;
	Если ДанныеЗаполнения.Свойство("СтрокаТаблицы") Тогда
		Груз = ДанныеЗаполнения.СтрокаТаблицы.Груз;
	КонецЕсли;
	
	ЗаполнитьПредопределенныеПараметры();
	
	Если ЗначениеЗаполнено(ТипПеревозки) Тогда
		
		ГруппыПараметровГрузоперевозки.Загрузить(ТипПеревозки.ГруппыПараметровГрузоперевозки.Выгрузить());
		Для каждого СтрокаПараметров Из ТипПеревозки.ПараметрыГрузоперевозки Цикл
			НайденаняСтрока = ПараметрыГрузоперевозки.Найти(СтрокаПараметров.Параметр, "Параметр");
			Если НайденаняСтрока = Неопределено Тогда
				НоваяСтрока = ПараметрыГрузоперевозки.Добавить();
				НоваяСтрока.Параметр = СтрокаПараметров.Параметр;
			КонецЕсли;
		КонецЦикла; 
		
		_УФС.ЗаполнитьПредопределенныеЗначенияРеквизитовШапки(ЭтотОбъект, ТипПеревозки, "ДляГрузоперевозки");
		
	КонецЕсли; 
	
	СоответствияИменРеквизитов = Перечисления.CW_РеквизитыКоносамента.ПолучитьСоответствияИменРеквизитов();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	СоответствиеРеквизитовПараметрам.РеквизитКоносамента КАК РеквизитКоносамента,
	               |	СоответствиеРеквизитовПараметрам.ИмяРеквизита КАК ИмяРеквизита,
	               |	СоответствиеРеквизитовПараметрам.ПараметрОбъекта КАК Параметр
	               |ИЗ
	               |	Справочник.CW_ТипыКоносаментов.СоответствиеРеквизитовМониторинговымПараметрам КАК СоответствиеРеквизитовПараметрам
	               |ГДЕ
	               |	СоответствиеРеквизитовПараметрам.Ссылка = &ТипКоносамента
	               |	И СоответствиеРеквизитовПараметрам.КопироватьВГрузоперевозки = ИСТИНА";
	
	Запрос.УстановитьПараметр("ТипКоносамента", Коносамент.ТипКоносамента);
	
	МетаданныеКоносамента = Коносамент.Метаданные();
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		
		ИмяРеквизита = СоответствияИменРеквизитов.Получить(Выборка.РеквизитКоносамента);    
		
		РеквизитСуществует 		= Ложь;
		ЭтоСтандартныйРеквизит 	= Ложь;   
		
		Если ОбщегоНазначения.ЭтоСтандартныйРеквизит(МетаданныеКоносамента.СтандартныеРеквизиты, ИмяРеквизита) Тогда
			ЭтоСтандартныйРеквизит = Истина;
			РеквизитСуществует = Истина;
		КонецЕсли; 
		
		Если Не ЭтоСтандартныйРеквизит Тогда
			Если СтрНачинаетсяС(ИмяРеквизита, "СтрокаТаблицы") Тогда
				РеквизитыТабличнойЧасти	= Метаданные.Справочники.CW_Коносаменты.ТабличныеЧасти.ГрузовыеЕдиницы.Реквизиты; 
				мПутьКДанным 	= СтрРазделить(ИмяРеквизита,".");  
				Реквизит 		= РеквизитыТабличнойЧасти.Найти(мПутьКДанным[1]);  
			Иначе
				Реквизиты 	= Метаданные.Справочники.CW_Коносаменты.Реквизиты;
				Реквизит 	= Реквизиты.Найти(ИмяРеквизита);  
			КонецЕсли;
			
			РеквизитСуществует = (Реквизит <> Неопределено);
		КонецЕсли;
		
		Если Не РеквизитСуществует Тогда
			Продолжить;	
		КонецЕсли;
		
		Если СтрНачинаетсяС(ИмяРеквизита, "СтрокаТаблицы") 
			И ДанныеЗаполнения.Свойство("СтрокаТаблицы")  Тогда 
			
			Выражение = "ДанныеЗаполнения[мПутьКДанным[0]][мПутьКДанным[1]]"; 
			Если Не ПустаяСтрока(Выборка.ИмяРеквизита) Тогда
				Выражение = Выражение + "."+СокрЛП(Выборка.ИмяРеквизита);
			КонецЕсли; 
			
			ЗначениеРеквизита = Вычислить(Выражение); 
		Иначе
			Выражение = "Коносамент[ИмяРеквизита]";
			Если Не ПустаяСтрока(Выборка.ИмяРеквизита) Тогда
				Выражение = Выражение + "."+СокрЛП(Выборка.ИмяРеквизита);
			КонецЕсли; 
			
			ЗначениеРеквизита = Вычислить(Выражение); 
		КонецЕсли;
		
		НайденаняСтрока = ПараметрыГрузоперевозки.Найти(Выборка.Параметр, "Параметр");
		Если НайденаняСтрока = Неопределено Тогда
			НайденаняСтрока = ПараметрыГрузоперевозки.Добавить();
			НайденаняСтрока.Параметр = Выборка.Параметр;   
		КонецЕсли;
		НайденаняСтрока.Значение = ЗначениеРеквизита;
	КонецЦикла;
	
	Запрос = Новый Запрос;  
	Запрос.Текст = "ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыТиповОбъектов.Параметр КАК Параметр
	|ПОМЕСТИТЬ ВТ_ДобавляемыеПараметры
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыТиповОбъектов КАК CW_МониторинговыеПараметрыТиповОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыТиповОбъектов.Владелец = &ТипКоносамента
	|	И CW_МониторинговыеПараметрыТиповОбъектов.КопироватьВГрузоперевозки = ИСТИНА
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	CW_МониторинговыеПараметрыОбъектов.Параметр КАК Параметр,
	|	CW_МониторинговыеПараметрыОбъектов.Значение КАК Значение,
	|	CW_МониторинговыеПараметрыОбъектов.ЗначениеПлан КАК ЗначениеПлан,
	|	CW_МониторинговыеПараметрыОбъектов.ЗначениеФакт КАК ЗначениеФакт
	|ИЗ
	|	Справочник.CW_МониторинговыеПараметрыОбъектов КАК CW_МониторинговыеПараметрыОбъектов
	|ГДЕ
	|	CW_МониторинговыеПараметрыОбъектов.Владелец = &Коносамент
	|	И CW_МониторинговыеПараметрыОбъектов.Параметр В
	|			(ВЫБРАТЬ
	|				ВТ_ДобавляемыеПараметры.Параметр КАК Параметр
	|			ИЗ
	|				ВТ_ДобавляемыеПараметры КАК ВТ_ДобавляемыеПараметры)";
	
	Запрос.УстановитьПараметр("Коносамент", 	Коносамент);
	Запрос.УстановитьПараметр("ТипКоносамента", Коносамент.ТипКоносамента);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() ЦИкл
		НайденаняСтрока = ПараметрыГрузоперевозки.Найти(Выборка.Параметр, "Параметр");
		Если НайденаняСтрока = Неопределено Тогда
			НайденаняСтрока = ПараметрыГрузоперевозки.Добавить();
			НайденаняСтрока.Параметр = Выборка.Параметр;         
		КонецЕсли;
		НайденаняСтрока.Значение = Выборка.Значение;
		НайденаняСтрока.ЗначениеПлан = Выборка.ЗначениеПлан;
		НайденаняСтрока.ЗначениеФакт = Выборка.ЗначениеФакт;
	КонецЦикла;

КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	// Получим значение дополнительного свойства "ИгнорироватьОбработкуКопирования".
	// Это свойство устанавливается в "Истина", если требуется игнорировать стандартные 
	// действия обработки данных в данной процедуре (за исключением присвоения уникального кода).
	ИгнорироватьОбработкуКопирования = _сф.ст_ПолучитьСвойство(ОбъектКопирования.ДополнительныеСвойства,"ИгнорироватьОбработкуКопирования",Ложь);
	Если ИгнорироватьОбработкуКопирования Тогда
		Код = "Tmp_"+Формат(ТекущаяДатаСеанса(),"ДФ=ddMMyyyyHHmm");
		Номер = 0;
		CW_Представление = CW_Представление + "_Тmp";
		Возврат;		
	КонецЕсли; 
	
	// параметры, устанавливаемые для новых объектов
	Архив = Ложь;
	Комментарий = "";
	Примечание = "";
	
	ОтслеживаемоеОборудование = Неопределено;
	ДатаПривязкиОборудования = Неопределено;
	
	// если в свойствах мониторингового параметра установлен флаг 
	// "очищать при коппировании", то очищаем значение параметра 
	Для каждого Стр Из ПараметрыГрузоперевозки Цикл
		Если Стр.Параметр.ОчищатьПриКопировании Тогда
			Стр.Значение		= Стр.Параметр.ТипЗначения.ПривестиЗначение(Неопределено); 
			Стр.ЗначениеПлан	= Дата(1,1,1);
			Стр.ЗначениеФакт	= Дата(1,1,1);
			Стр.Примечание		= "";
		КонецЕсли; 
	КонецЦикла; 
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	// получим необходимые данные
	СоответствиеСвойствПараметров = CW_Мониторинг.ПолучитьСоответствиеСвойствПараметров();
	//ВременныйОбъект = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ВременныйОбъект",Ложь);
	ИнтерактивныйРежим = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ИнтерактивныйРежим",Ложь);
	
	// установим дополнительные свойства для дальнейшей обработки
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ИзменениеПометкиУдаления",(ПометкаУдаления <> Ссылка.ПометкаУдаления));
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ИзменениеЗаказа",(Заказ <> Ссылка.Заказ));
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СтарыйЗаказ",Ссылка.Заказ);
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"СоответствиеСвойствПараметров",СоответствиеСвойствПараметров);
	
	// если грузоперевозка записывается в интерактивном режиме,
	// то проконтролируем заполнение обязательных реквизитов и параметров,
	// указанных в типе перевозки
	Если (ИнтерактивныйРежим) Тогда
		ПроверитьЗаполнениеГрузоперевозки(СоответствиеСвойствПараметров);
		Заполнена = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ГрузоперевозкаЗаполненаКорректно",Ложь);
		Если (НЕ Заполнена) Тогда
			Отказ = Истина;
			Возврат;
		КонецЕсли; 
		
		// запись грузоперевозки программным способом
	Иначе
		
		// для временных объектов заполнение предопределенных параметров не производим
		//			Если Не ВременныйОбъект Тогда
		ЗаполнитьПредопределенныеПараметры();
		//			КонецЕсли; 
		ПроверитьЗаполнениеГрузоперевозки(СоответствиеСвойствПараметров);
		ОбработатьИзменениеПараметров(СоответствиеСвойствПараметров);
	КонецЕсли; 
	
	ПроверитьДатуПривязкиОборудования();
	ПроверитьПредопределенныеПараметрыОтслеживаемогоОборудования();
	ПроверитьПараметрыГрузоперевозки();
	ОпределитьНаборДинамическихПараметров(СоответствиеСвойствПараметров);
	
	_сф.УстановитьЗначение(CW_Представление, СокрЛП(CW_Представление));
	_сф.УстановитьЗначение(Наименование, СокрЛП(CW_Представление));
	
	Если ЭтотОбъект.ЭтоНовый() Тогда
		Ответственный = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;
	
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	Конецесли;
	
	// ЛОГИРОВАНИЕ ПО НЕЗАПОЛНЕННЫМ ПАРАМЕТРАМ
	// ----------------------------------------
	Если (Незаполнена) Тогда
		Ссылки = Новый Массив;
		Ссылки.Добавить(Ссылка);
		CW_Журнал.ЗаписатьСообщение("КонтрольЗаполнения.Грузоперевозки",Перечисления.CW_ПриоритетыСистемныхСообщений.p6,_сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ТекстПредупрежденияНезаполненных"),Ссылки);
	КонецЕсли; 
	
	// КОЛИЧЕСТВО ГРУЗОПЕРЕВОЗОК ПО ЗАКАЗАМ
	//-------------------------------------
	ИзмененаПометкаУдаления = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ИзменениеПометкиУдаления");
	Если (ИзмененаПометкаУдаления) Тогда
		Если (ЗначениеЗаполнено(Заказ)) Тогда
			CW_Мониторинг.ОбновитьКоличествоГрузоперевозокПоЗаказу(Заказ); 
		КонецЕсли; 
	КонецЕсли; 
	
	ИзменениеЗаказа = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ИзменениеЗаказа");
	Если (ИзменениеЗаказа) Тогда
		Если (ЗначениеЗаполнено(Заказ)) Тогда
			CW_Мониторинг.ОбновитьКоличествоГрузоперевозокПоЗаказу(Заказ); 
		КонецЕсли; 
		// --- 
		СтарыйЗаказ = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"СтарыйЗаказ");
		Если (ЗначениеЗаполнено(СтарыйЗаказ)) Тогда
			CW_Мониторинг.ОбновитьКоличествоГрузоперевозокПоЗаказу(СтарыйЗаказ); 
		КонецЕсли; 
	КонецЕсли; 
	
	ЗаписатьМониторинговыеПараметрыВРегистр(Ссылка);
	
	//Подсистема.МониторингОборудования 
	CW_МониторингОборудованияСервер.ЗаписатьСтатусыОборудования(Ссылка, ОтслеживаемоеОборудование); 
	//Подсистема.МониторингОборудования
	
	// СИНХРОНИЗАЦИЯ ПОМЕТКИ УДАЛЕНИЯ СТАТЕЙ БЮДЖЕТОВ
	// ----------------------------------------------
	Если (_сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ИзменениеПометкиУдаления") = Истина) Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	CW_ПлановыеСтатьиЗатратИДоходов.Ссылка
		|ИЗ
		|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		|ГДЕ
		|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец = &Владелец";
		Запрос.УстановитьПараметр("Владелец", Ссылка);
		ТЗ = Запрос.Выполнить().Выгрузить();
		Для каждого Стр Из ТЗ Цикл
			
			СтатьяБюджета = Стр.Ссылка.ПолучитьОбъект();
			СтатьяБюджета.УстановитьПометкуУдаления(ПометкаУдаления);
			
		КонецЦикла; 
		
	КонецЕсли; 
	
	// КОПИРОВАНИЕ БЮДЖЕТОВ ПРИ КОПИРОВАНИИ
	// ---------------------------------------------------------------------------- 
	АдресНастроекКопирования = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"АдресНастроекКопирования");
	Если (АдресНастроекКопирования <> Неопределено) Тогда
		
		НастройкиКопирования = ПолучитьИзВременногоХранилища(АдресНастроекКопирования);
		// --- 
		ОбъектКопирования = НастройкиКопирования.ОбъектКопирования;
		Если (НастройкиКопирования.Грузоперевозки <> Неопределено) Тогда
			
			// --- 
			Если (НастройкиКопирования.ВерсииБюджетов <> Неопределено) Тогда
				
				Если (_сф.Количество(НастройкиКопирования.ВерсииБюджетов)<>0) Тогда
					
					Ответ = CW_Бюджетирование.СкопироватьБюджеты(ОбъектКопирования,Ссылка,НастройкиКопирования.ВерсииБюджетов,НастройкиКопирования.ОчищатьПоказателиБюджетов);
					Если (НЕ _УФКС.ВыполненоУспешно(Ответ)) Тогда
						
						Отказ = Истина;
						Возврат;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
		// -----
		Если НастройкиКопирования.ОчищатьСсылкуНаЗаказ  Тогда
			Заказ = Неопределено;	
		КонецЕсли;
		// -----
		
		_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"АдресНастроекКопирования","");
		
	КонецЕсли; 
	
	// КОПИРОВАНИЕ БЮДЖЕТОВ ПРИ ВВОДЕ НА ОСНОВАНИИ ЗАЯВКИ
	// ---------------------------------------------------------------------------- 
	КопироватьБюджетИзЗаявки = _сф.ст_ПолучитьСвойство(ДополнительныеСвойства,"ПеренестиБюджетИзЗаявки",Ложь);
	Если (КопироватьБюджетИзЗаявки) Тогда
		
		Если ДополнительныеСвойства.Свойство("СписокВариантовБюджета") Тогда
			СписокВариантовБюджета = ДополнительныеСвойства.СписокВариантовБюджета;
		Иначе
			Запрос = Новый Запрос;
			Запрос.Текст = "ВЫБРАТЬ
			|	CW_ВариантыБюджетовПоЗаявкам.Ссылка КАК Ссылка
			|ИЗ
			|	Справочник.CW_ВариантыБюджетовПоЗаявкам КАК CW_ВариантыБюджетовПоЗаявкам
			|ГДЕ
			|	CW_ВариантыБюджетовПоЗаявкам.Владелец = &Заявка
			|	И CW_ВариантыБюджетовПоЗаявкам.ПометкаУдаления = ЛОЖЬ";
			
			Запрос.УстановитьПараметр("Заявка", Заявка);
			РезультатЗапроса = Запрос.Выполнить();
			СписокВариантовБюджета = РезультатЗапроса.Выгрузить().ВыгрузитьКолонку("Ссылка");
		КонецЕсли;
		
		Запрос = Новый Запрос; 
		Запрос.Текст = "ВЫБРАТЬ
		|	МАКСИМУМ(CW_ПлановыеСтатьиЗатратИДоходов.Ссылка) КАК Ссылка,
		|	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования КАК ВидСтатьиПланирования,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Организация КАК Организация,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент КАК Контрагент,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура КАК Номенклатура,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта КАК Валюта,
		|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов КАК ПорядокОтраженияРасходов,
		|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияДоходов КАК ПорядокОтраженияДоходов,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.Сумма) КАК Сумма,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсего) КАК СуммаВсего,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаВсегоРуб) КАК СуммаВсегоРуб,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДС) КАК СуммаНДС,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаНДСРуб) КАК СуммаНДСРуб,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.СуммаРуб) КАК СуммаРуб,
		|	СУММА(CW_ПлановыеСтатьиЗатратИДоходов.Количество) КАК Количество
		|ИЗ
		|	Справочник.CW_ПлановыеСтатьиЗатратИДоходов КАК CW_ПлановыеСтатьиЗатратИДоходов
		|ГДЕ
		|	CW_ПлановыеСтатьиЗатратИДоходов.Владелец В(&СписокВариантовБюджета)
		|	И CW_ПлановыеСтатьиЗатратИДоходов.ПометкаУдаления = ЛОЖЬ
		|
		|СГРУППИРОВАТЬ ПО
		|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияДоходов,
		|	CW_ПлановыеСтатьиЗатратИДоходов.ПорядокОтраженияРасходов,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Валюта,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Номенклатура,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Контрагент,
		|	CW_ПлановыеСтатьиЗатратИДоходов.Организация,
		|	CW_ПлановыеСтатьиЗатратИДоходов.ВидСтатьиПланирования";
		
		Запрос.УстановитьПараметр("СписокВариантовБюджета", СписокВариантовБюджета); 
		
		РезультатЗапроса = Запрос.Выполнить();  
		
		Выборка = РезультатЗапроса.Выбрать();
		Пока Выборка.Следующий() Цикл
			
			НоваяСтатья = Выборка.Ссылка.Скопировать();
			НоваяСтатья.Владелец = Ссылка;
			ДополнительныеСвойства.Свойство("ВерсияБюджета", НоваяСтатья.ВерсияБюджета); 
			
			ЗаполнитьЗначенияСвойств(НоваяСтатья, Выборка,"Сумма,СуммаВсего,СуммаНДС,Количество,СуммаВсегоРуб,СуммаНДСРуб,СуммаРуб,Количество");
			
			НоваяСтатья.Цена 	= Выборка.Сумма / ?(Выборка.Количество=0, 1, Выборка.Количество);      
			НоваяСтатья.ЦенаРуб = Выборка.СуммаРуб / ?(Выборка.Количество=0, 1, Выборка.Количество);      
			
			НоваяСтатья.ТипКурсаВалюты = 1;      
			Если Выборка.СуммаВсего <> 0 Тогда  
				НоваяСтатья.Курс = Окр(Выборка.СуммаВсегоРуб/Выборка.СуммаВсего, 4);
			Иначе
				НоваяСтатья.Курс = 1;	
			КонецЕсли;
			
			НоваяСтатья.Записать();
			
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры

// Записывает значения мониторинговых параметров грузоперевозки из табличной части врегистр
Процедура ЗаписатьМониторинговыеПараметрыВРегистр(ТекущаяСсылка) Экспорт
	
	ТаблицаПараметров = ТекущаяСсылка.ПараметрыГрузоперевозки.Выгрузить();
	
	НаборЗаписей = ПолучитьНаборЗаписейХарактеристик(ТекущаяСсылка);
	ДобавитьЗаписиПоСлужебнымПараметрам(ТаблицаПараметров,ТекущаяСсылка);
	ДобавитьЗаписиПоДинамическимПараметрам(ТаблицаПараметров,ТекущаяСсылка);
	ЗаписатьНаборЗаписейХарактеристик(НаборЗаписей,ТаблицаПараметров, ТекущаяСсылка);

КонецПроцедуры // ЗаписатьМониторинговыеПараметрыВРегистр()

Функция ПолучитьНаборЗаписейХарактеристик(ТекущаяСсылка)
	
	НаборЗаписей = РегистрыСведений.CW_ХарактеристикиГрузоперевозок.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Грузоперевозка.Значение = ТекущаяСсылка;
	НаборЗаписей.Отбор.Грузоперевозка.Использование = Истина;
	
	Возврат(НаборЗаписей);
КонецФункции

Процедура ЗаписатьНаборЗаписейХарактеристик(НаборЗаписей, ТаблицаПараметров, ТекущаяСсылка)
	
	ТаблицаПараметров.Колонки.Добавить("Грузоперевозка");
	ТаблицаПараметров.ЗаполнитьЗначения(ТекущаяСсылка, "Грузоперевозка");
	
	НаборЗаписей.Очистить();
	
	//Дополняем данные хранилища значений
	Для Каждого СтрокаПараметров из ТаблицаПараметров Цикл
		
		СтрокаНабора = НаборЗаписей.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаНабора,СтрокаПараметров,,"ХранилищеДанных");
		
		//Новый механизм
		СтрокаНабора.Порядок = СтрокаПараметров.НомерСтроки;
		//Новый механизм
		
		//Записываем данны из хранилизазанчений
		Отбор = Новый Структура("Параметр",СтрокаПараметров.Параметр);
		мСтроки = ТекущаяСсылка.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		//Должна быть одна строка
		Если мСтроки.Количество() > 0 Тогда
			СтрокаДанных = мСтроки[0]; 
			СтрокаНабора.ХранилищеДанных = новый ХранилищеЗначения(СтрокаДанных.ХранилищеДанных.Получить());	
		КонецЕсли;
		
	КонецЦикла;
	
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

Процедура ДобавитьЗаписиПоСлужебнымПараметрам(ТаблицаДвижений, ТекущаяСсылка)
	
	// добавляем служебный параметр
	Нстр = ТаблицаДвижений.Добавить();
	Нстр.Параметр = ПланыВидовХарактеристик.CW_ПараметрыГрузоперевозок.Служебный;
	Нстр.Значение = Ложь;
	
КонецПроцедуры

Процедура ДобавитьЗаписиПоДинамическимПараметрам(ТаблицаДвижений,ТекущаяСсылка)
	
	СоответствиеСвойствПараметров = _сф.ДС(ЭтотОбъект).СоответствиеСвойствПараметров;
	МассивДинамическихПараметров = _сф.ДС(ЭтотОбъект).МассивДинамическихПараметров;
	
	МассивУдаления = Новый Массив;
	Для каждого Стр Из ТаблицаДвижений Цикл
		Если (МассивДинамическихПараметров.Найти(Стр.Параметр) <> Неопределено) Тогда
			МассивУдаления.Добавить(Стр);
		КонецЕсли; 
	КонецЦикла; 
	_сф.к_УдалитьЭлементыПоМассиву(ТаблицаДвижений,МассивУдаления);
	
	Ответ = CW_Мониторинг.ДинамическиеПараметрыОбъекта(ТекущаяСсылка,СоответствиеСвойствПараметров,МассивДинамическихПараметров);
	Для каждого Стр Из Ответ Цикл
		Нстр = ТаблицаДвижений.Добавить();
		ЗаполнитьЗначенияСвойств(Нстр,Стр);
	КонецЦикла; 
	
КонецПроцедуры

Процедура ПроверитьЗаполнениеГрузоперевозки(СоответствиеСвойствПараметров)
	
	флНезаполнена = Ложь;
	МассивСообщений = Новый Массив;
	
	// проверяем заполнение обязательных реквизитов и параметров г/п
	Если (ЗначениеЗаполнено(ТипПеревозки)) Тогда
		
		Если (ТипПеревозки.КонтрольЗаполненияКлиента И НЕ ЗначениеЗаполнено(Клиент)) Тогда
			
			МассивСообщений.Добавить("Не заполнен обязательный реквизит ""Клиент""");
			флНезаполнена = Истина;
			
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияТипоразмера И НЕ ЗначениеЗаполнено(Типоразмер)) Тогда
			
			МассивСообщений.Добавить("Не заполнен обязательный реквизит ""Типоразмер клиента""");
			флНезаполнена = Истина;
			
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияГруза И Константы.CW_Мониторинг_Груз.Получить() И НЕ ЗначениеЗаполнено(Груз)) Тогда
			
			МассивСообщений.Добавить("Не заполнен обязательный реквизит ""Груз""");
			флНезаполнена = Истина;
			
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияМаршрута И Константы.CW_Мониторинг_Маршрут.Получить() И НЕ ЗначениеЗаполнено(Маршрут)) Тогда
			
			МассивСообщений.Добавить("Не заполнен обязательный реквизит ""Маршрут""");
			флНезаполнена = Истина;
			
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияОперативногоМенеджера И Константы.CW_Мониторинг_ОперативныйМенеджер.Получить() И НЕ ЗначениеЗаполнено(ОперативныйМенеджер)) Тогда
			
			МассивСообщений.Добавить("Не заполнен обязательный реквизит ""Оперативный менеджер""");
			флНезаполнена = Истина;
			
		КонецЕсли; 
		
		Если (ТипПеревозки.КонтрольЗаполненияМенеджераПродаж И Константы.CW_Мониторинг_МенеджерПродаж.Получить() И НЕ ЗначениеЗаполнено(МенеджерПродаж)) Тогда
			
			МассивСообщений.Добавить("Не заполнен обязательный реквизит ""Менеджер продаж""");
			флНезаполнена = Истина;
			
		КонецЕсли; 
		
		Отбор = Новый Структура("КонтрольЗаполнения",Истина);
		КонтроллируемыеПараметры = ТипПеревозки.ПараметрыГрузоперевозки.Выгрузить(Отбор);
		Для каждого Стр Из КонтроллируемыеПараметры Цикл
			
			флПараметрНезаполнен = Ложь;
			ОтборПоПараметру = Новый Структура("Параметр", Стр.Параметр);
			СтрокаПараметра = _сф.к_НайтиСтроку(ПараметрыГрузоперевозки,ОтборПоПараметру);
			СП = СоответствиеСвойствПараметров.Получить(Стр.Параметр);
			Если (СтрокаПараметра = Неопределено) Тогда
				флПараметрНезаполнен = Истина;
			Иначе
				Если (НЕ ЗначениеЗаполнено(СтрокаПараметра.Значение)) Тогда
					флПараметрНезаполнен=Истина;
				КонецЕсли; 
			КонецЕсли; 
			
			Если (флПараметрНезаполнен) Тогда
				
				МассивСообщений.Добавить("Грузоперевозка ("+Строка(Код)+") "+Строка(CW_Представление)+": "+"Не заполнен обязательный параметр """+СП.Наименование+"""");
				флНезаполнена = Истина;
				
			КонецЕсли; 
			
		КонецЦикла; 
		
	Иначе
		
		// если не указан тип перевозки считаем её незаполненной
		флНезаполнена = Истина;
	КонецЕсли; 
	
	Незаполнена = флНезаполнена;
	Если (Незаполнена) Тогда
		Для каждого Сообщение Из МассивСообщений Цикл
			Сообщить(Сообщение);
		КонецЦикла; 
		
		ТекстСообщения = "Грузоперевозка """+Строка(CW_Представление)+"""; Пользователь: "+Строка(CW_Настройки.Пользователь());
		ТекстСообщения = ТекстСообщения + Символы.ПС+_сф.м_Представление(МассивСообщений,Символы.ПС);
		_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ТекстПредупрежденияНезаполненных",ТекстСообщения);
		
	КонецЕсли;
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"ГрузоперевозкаЗаполненаКорректно",(НЕ Незаполнена));
	
КонецПроцедуры

Процедура ОпределитьНаборДинамическихПараметров(СоответствиеСвойствПараметров)
	// --- 
	
	// определяем набор изменившихся параматров
	МассивДинамическихПараметров = Новый Массив;
	Если (ПолучитьФункциональнуюОпцию("CW_ИспользованиеДинамическихПараметров")) Тогда
		Для каждого Стр Из ПараметрыГрузоперевозки Цикл
			СП = СоответствиеСвойствПараметров.Получить(Стр.Параметр);
			Если (СП.ДинамическийПараметр) Тогда
				МассивДинамическихПараметров.Добавить(Стр.Параметр);
			КонецЕсли; 
		КонецЦикла; 	
	КонецЕсли; 
	_сф.ст_УстановитьСвойство(ДополнительныеСвойства,"МассивДинамическихПараметров",МассивДинамическихПараметров);

	
	// --- 
КонецПроцедуры

Процедура ОбработатьИзменениеПараметров(СоответствиеСвойствПараметров)
	
	Для каждого СтрП Из ПараметрыГрузоперевозки Цикл
		СП = СоответствиеСвойствПараметров.Получить(СтрП.Параметр);
		
		Если СП.ОбработкаИзменения Тогда
			
			ТребуетсяОбработка = Ложь;
			// проверяем, изменилось ли значение
			
			СтрокаТЧ = Ссылка.ПараметрыГрузоперевозки.Найти(СтрП.Параметр,"Параметр");
			Если (СтрокаТЧ = Неопределено) Тогда
				
				ТребуетсяОбработка = Истина;
				
			Иначе
				
				Если (СП.ЭтоКонтрольнаяДата) Тогда
					
					Если СтрокаТЧ.ЗначениеФакт <> СтрП.ЗначениеФакт 
						ИЛИ СтрокаТЧ.ЗначениеПлан <> СтрП.ЗначениеПлан Тогда
						
						ТребуетсяОбработка = Истина;
						
					КонецЕсли; 
					
				Иначе
					
					Если СтрокаТЧ.Значение <> СтрП.Значение Тогда
						
						ТребуетсяОбработка = Истина;
						
					КонецЕсли; 
					
				КонецЕсли; 
				
			КонецЕсли; 
			
			Если (ТребуетсяОбработка) Тогда
				
				Если (ЗначениеЗаполнено(СП.ВнешняяОбработкаИзменения)) Тогда
					
					ОбработкаОбъект = _ПО.ПолучитьОбработку(СтрП.Параметр.ВнешняяОбработкаИзменения); 
					Попытка  
						ПараметрыПроцедуры = новый Структура;
						ПараметрыПроцедуры.Вставить("ВнешняяОбработка",	СтрП.Параметр.ВнешняяОбработкаИзменения);
						ПараметрыПроцедуры.Вставить("Объект", 			ЭтотОбъект);
						ПараметрыПроцедуры.Вставить("СтрокаПараметра", 	СтрП);
						
						Результат = ОбработкаОбъект.ВыполнитьОбработкуИзмененияПараметра(ПараметрыПроцедуры); 
					Исключение  
						//Поддержка старых версий обработок
						Результат = ОбработкаОбъект.ОбработкаИзмененияПараметра(ЭтотОбъект,Неопределено,СтрП);  
					КонецПопытки;
					
					ОбработкаОбъект = Неопределено;
					
					Если (_УФКС.ВыполненоУспешно(Результат)) Тогда
						
						// параметры
						ТаблицаПараметров = Неопределено;
						Результат.Свойство("ТаблицаПараметров",ТаблицаПараметров);
						Если (ТаблицаПараметров <> Неопределено) Тогда
							
							Для каждого Стр Из ТаблицаПараметров Цикл
								
								Отбор = Новый Структура("Параметр", Стр.Параметр);
								ЗаполняемаяСтрокаПараметра = _сф.к_НайтиСтроку(ЭтотОбъект.ПараметрыГрузоперевозки,Отбор);
								Если (ЗаполняемаяСтрокаПараметра = Неопределено) Тогда
									ЗаполняемаяСтрокаПараметра = ЭтотОбъект.ПараметрыГрузоперевозки.Добавить();
									ТребуетсяПолноеОбновление = Истина;
								КонецЕсли; 
								ЗаполнитьЗначенияСвойств(ЗаполняемаяСтрокаПараметра, Стр);
								
							КонецЦикла; 
							
						КонецЕсли;
						
						// реквизиты
						СтруктураРеквизитов = Неопределено;
						Результат.Свойство("СтруктураРеквизитов",СтруктураРеквизитов);
						Если (СтруктураРеквизитов <> Неопределено) Тогда
							
							ЗаполнитьЗначенияСвойств(ЭтотОбъект, СтруктураРеквизитов);
							
						КонецЕсли; 
						
					Иначе
						
						Сообщить(_УФКС.ПредставлениеОшибки(Результат));
						
					КонецЕсли; 
					
					
				КонецЕсли; 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры
  
Процедура ПроверитьДатуПривязкиОборудования()
	// --- 
	
	Если (ЗначениеЗаполнено(ОтслеживаемоеОборудование)) Тогда
		
		Если (ДатаПривязкиОборудования <> ДатаСделкиФ) Тогда
			
			ДатаПривязкиОборудования = ДатаСделкиФ;
			
		КонецЕсли;
		
	КонецЕсли; 
	
	 
	
	//// устанавливаем дату привязки оборудования
	//Если (ЗначениеЗаполнено(ОтслеживаемоеОборудование)) Тогда
	//	
	//	Если (НЕ ЗначениеЗаполнено(ДатаПривязкиОборудования)) Тогда
	//		
	//		ДатаПривязкиОборудования = ТекущаяДата();
	//		
	//	КонецЕсли; 
	//	
	//КонецЕсли;
	
	// --- 
КонецПроцедуры

Процедура ПроверитьПредопределенныеПараметрыОтслеживаемогоОборудования()
	
	Если ЗначениеЗаполнено(ОтслеживаемоеОборудование) Тогда
		
		Отбор = Новый Структура;
		Отбор.Вставить("ДобавлятьВКарточку", Истина);
		
		мСтроки = ОтслеживаемоеОборудование.ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
		Для каждого СтрокаМассива из мСтроки Цикл
			
			Отбор = Новый Структура;
			Отбор.Вставить("Параметр", СтрокаМассива.Параметр);
			
			мСтроки = ПараметрыГрузоперевозки.НайтиСтроки(Отбор);
			Если мСтроки.Количество() <> 0 Тогда
				НоваяСтрока = мСтроки[0];  //Всегда одна строка
			Иначе
				НоваяСтрока = ПараметрыГрузоперевозки.Добавить();
				НоваяСтрока.Параметр	= СтрокаМассива.Параметр;
			КонецЕсли;
			
			НоваяСтрока.Значение	= СтрокаМассива.Значение;
			НоваяСтрока.Примечание 	= СтрокаМассива.Примечание;
			
		КонецЦикла;

	КонецЕсли; 
	
КонецПроцедуры
 
Процедура ПроверитьПараметрыГрузоперевозки()
	
	// проверим "Значение" на Неопределено
	МассивУдаления = Новый Массив;
	Для Каждого Стр из ПараметрыГрузоперевозки Цикл
		Если (НЕ ЗначениеЗаполнено(Стр.Параметр)) Тогда
			МассивУдаления.Добавить(Стр);
		КонецЕсли; 
 
		Если Стр.Значение = Неопределено Тогда
			Стр.Значение = Стр.Параметр.ТипЗначения.ПривестиЗначение();
		КонецЕсли;	
	КонецЦикла;	
	_сф.к_УдалитьЭлементыПоМассиву(ПараметрыГрузоперевозки,МассивУдаления);
	
КонецПроцедуры

Процедура ЗаполнитьПредопределенныеПараметры()
	
	МассивПроверяемыхРеквизитов = _сф.м_СоздатьИзСтроки("Клиент,Маршрут,ТипПеревозки,Груз,Типоразмер");
	Для каждого Реквизит Из МассивПроверяемыхРеквизитов Цикл
		Если (_сф.РеквизитИзменен(ЭтотОбъект,Реквизит)) Тогда
			ПП = CW_Мониторинг.ПолучитьПредопределенныеПараметры(ЭтотОбъект[Реквизит],Реквизит);
			Если (_УФКС.ВыполненоУспешно(ПП)) Тогда
				CW_Мониторинг.ДобавитьПредопределенныеПараметры(ЭтотОбъект,ПП.Параметры);
			КонецЕсли; 
		КонецЕсли; 	
	КонецЦикла; 
	
КонецПроцедуры
 
Процедура ПроверитьИерархиюПараметров() Экспорт 
	// --- 
	
	Если (ГруппыПараметровГрузоперевозки.Количество()=0) Тогда
		
		// требуется сформировать группы по текущей иерархии параметров
		
		// добавляем корневой элемент
		КорневаяГруппа = ГруппыПараметровГрузоперевозки.Добавить();
		КорневаяГруппа.Идентификатор = 0;
		КорневаяГруппа.ИдентификаторВедущего=0;
		КорневаяГруппа.Наименование = "Корень";
		КорневаяГруппа.Раскрывать = Истина;
		
		// получаем родителей текущих параметров
		ТЗП = ПараметрыГрузоперевозки.Выгрузить();
		ТЗП.Колонки.Добавить("Код");
		ТЗП.Колонки.Добавить("Родитель");
		ТЗП.Колонки.Добавить("КодРодителя");
		Для каждого Стр Из ТЗП Цикл
			
			Стр.Код = Стр.Параметр.Код;
			Стр.Родитель = Стр.Параметр.Родитель;
			Стр.КодРодителя = Стр.Родитель.Код;
			
		КонецЦикла; 
		
		ТЗР = ТЗП.Скопировать(,"Родитель,КодРодителя");
		ТЗР.Свернуть("Родитель,КодРодителя");
		ТЗР.Сортировать("КодРодителя Возр");
		// --- 
		МассивГруппВерхнегоУровня = Новый Массив;
		ЕстьПустойРодитель = Ложь;
		МассивПараметровБезРодителя = Новый Массив;
		Индекс = 1;
		Для каждого СтрРодитель Из ТЗР Цикл
			
			Отбор = Новый Структура("Родитель",СтрРодитель.Родитель);
			// --- 
			Если (СтрРодитель.Родитель.Пустая()) Тогда
				
				ЕстьПустойРодитель=Истина;
				ТЗПБР = ТЗП.Скопировать(Отбор);
				ТЗПБР.Сортировать("Код Возр");
				Для каждого СтрПБР Из ТЗПБР Цикл
					МассивПараметровБезРодителя.Добавить(Стр.Параметр);
				КонецЦикла;
				
			Иначе
				
				// создаем
				Нстр = ГруппыПараметровГрузоперевозки.Добавить();
				Нстр.Идентификатор = Индекс;
				_сф.Инкремент(Индекс);
				Нстр.ИдентификаторВедущего = 0;
				Нстр.Раскрывать = Истина;
				// --- 
				Нстр.Наименование = Строка(СтрРодитель.Родитель);
				
				// формируем подчиненные
				ТЗПР = ТЗП.Скопировать(Отбор);
				ТЗПР.Сортировать("Код Возр");
				// --- 
				МассивПараметров = ТЗПР.ВыгрузитьКолонку("Параметр");
				Нстр.ИдентификаторыВедомых=ЗначениеВСтрокуВнутр(МассивПараметров);
				
				МассивГруппВерхнегоУровня.Добавить(Нстр);
				
			КонецЕсли; 
			
		КонецЦикла; 
		
		// --- 
		
		МассивЭлементовВерхнегоУровня = Новый Массив;
		Для каждого СтрРодитель Из МассивГруппВерхнегоУровня Цикл
			
			МассивЭлементовВерхнегоУровня.Добавить(СтрРодитель.Идентификатор);
			
		КонецЦикла; 
		Если (МассивПараметровБезРодителя.Количество()<>0) Тогда
			
			Для каждого Параметр Из МассивПараметровБезРодителя Цикл
				
				МассивЭлементовВерхнегоУровня.Добавить(Параметр);
				
			КонецЦикла; 
			
		КонецЕсли; 
		КорневаяГруппа.ИдентификаторыВедомых = ЗначениеВСтрокуВнутр(МассивЭлементовВерхнегоУровня);
		// --- 
		
	КонецЕсли; 
	
	// --- 
КонецПроцедуры

Процедура ПриУстановкеНовогоКода(СтандартнаяОбработка, Префикс) 
	
	НумерацияВПределахЗаказа = Константы.CW_АвтоматическаяНумерацияВПределахЗаказа.Получить();	
	Если НумерацияВПределахЗаказа Тогда 
		Префикс = "0-";	
		Если ЗначениеЗаполнено(ЭтотОбъект.Заказ) Тогда
			Префикс = Формат(ЭтотОбъект.Заказ.Код, "ЧН=0; ЧГ=0") + "-";	
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
